src/Documents/НазначениеУчетнойПолитики/НазначениеУчетнойПолитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеУчетнойПолитики</name>
  <registerRecords>InformationRegister.УчетнаяПолитика</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>МетодСписанияСебестоимости</name>
    <type>
      <types>EnumRef.УчетнаяПолитика</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МетодСписанияСебестоимости</name>
    <type>
      <types>EnumRef.УчетнаяПолитика</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номеклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодФилиал</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетнаяПолитика</name>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
  <enumValues>
    <name>Среднее</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НазначениеУчетнойПолитики/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check module-region-empty
#Область ОписаниеПеременных
#КонецОбласти

//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	СтарыйМетодСписанияСебестоимости = гваУчетнаяПолитика.МетодСписанияСебестоимости(Дата - 1);
	Если СтарыйМетодСписанияСебестоимости = МетодСписанияСебестоимости Тогда
		ТекстСообщения = НСтр("ru='Метод списания себестоимости соответствует уже установленному методу'"); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;

	// регистр УчетнаяПолитика
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.МетодСписанияСебестоимости = МетодСписанияСебестоимости;
	
	// регистр ОстаткиНоменклатуры
	Если МетодСписанияСебестоимости = Перечисления.УчетнаяПолитика.Среднее Тогда
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Движения.Записать();
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
			|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
			|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество,
			|	ОстаткиНоменклатурыОстатки.СтоимостьОстаток КАК Стоимость
			|ИЗ
			|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментВремени,) КАК ОстаткиНоменклатурыОстатки
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Стоимость)
			|ПО
			|	Склад,
			|	Номенклатура";
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		
		ВыборкаСклад = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			ВыборкаНоменклатура = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаНоменклатура);
				Движение.Период = Дата;
		
				ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
					ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
					Движение.Период = Дата;			
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции
#КонецОбласти

//@skip-check module-region-empty
#Область Инициализация
#КонецОбласти

#КонецЕсли
